Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
      = {} -> (known after apply)
      ~ tags               = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all           = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_stack will be updated in-place
  ~ resource "aws_cloudformation_stack" "sbeacon_terms_stack" {
        id                 = "arn:aws:cloudformation:ap-southeast-3:727260606489:stack/sbeacon-terms-stack/1bc8a01d-8bff-42af-8c7f-0c08cf8f284a"
        name               = "sbeacon-terms-stack"
      ~ outputs            = {} -> (known after apply)
      ~ tags               = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all           = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_cloudfront_distribution.api_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "api_distribution" {
        id                              = "E1VZY9FM3SJBCP"
      ~ tags                            = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                        = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.anscestor_terms will be updated in-place
  ~ resource "aws_dynamodb_table" "anscestor_terms" {
        id                          = "sbeacon-Anscestors"
        name                        = "sbeacon-Anscestors"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinic_jobs will be updated in-place
  ~ resource "aws_dynamodb_table" "clinic_jobs" {
        id                          = "sbeacon-dataportal-clinic-jobs"
        name                        = "sbeacon-dataportal-clinic-jobs"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_annotations will be updated in-place
  ~ resource "aws_dynamodb_table" "clinical_annotations" {
        id                          = "sbeacon-dataportal-clinical-annotations"
        name                        = "sbeacon-dataportal-clinical-annotations"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_variants will be updated in-place
  ~ resource "aws_dynamodb_table" "clinical_variants" {
        id                          = "sbeacon-dataportal-clinical-variants"
        name                        = "sbeacon-dataportal-clinical-variants"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_locks_table will be updated in-place
  ~ resource "aws_dynamodb_table" "dataportal_locks_table" {
        id                          = "sbeacon-dataportal-mutex-locks"
        name                        = "sbeacon-dataportal-mutex-locks"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_pricing_cache will be updated in-place
  ~ resource "aws_dynamodb_table" "dataportal_pricing_cache" {
        id                          = "sbeacon-dataportal-pricing-cache"
        name                        = "sbeacon-dataportal-pricing-cache"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.descendant_terms will be updated in-place
  ~ resource "aws_dynamodb_table" "descendant_terms" {
        id                          = "sbeacon-Descendants"
        name                        = "sbeacon-Descendants"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.juptyer_notebooks will be updated in-place
  ~ resource "aws_dynamodb_table" "juptyer_notebooks" {
        id                          = "sbeacon-dataportal-juptyer-notebooks"
        name                        = "sbeacon-dataportal-juptyer-notebooks"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.ontologies will be updated in-place
  ~ resource "aws_dynamodb_table" "ontologies" {
        id                          = "sbeacon-Ontologies"
        name                        = "sbeacon-Ontologies"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.project_users will be updated in-place
  ~ resource "aws_dynamodb_table" "project_users" {
        id                          = "sbeacon-dataportal-project-users"
        name                        = "sbeacon-dataportal-project-users"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.projects will be updated in-place
  ~ resource "aws_dynamodb_table" "projects" {
        id                          = "sbeacon-dataportal-projects"
        name                        = "sbeacon-dataportal-projects"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.saved_queries will be updated in-place
  ~ resource "aws_dynamodb_table" "saved_queries" {
        id                          = "sbeacon-dataportal-saved-queries"
        name                        = "sbeacon-dataportal-saved-queries"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.sbeacon_dataportal_users_info will be updated in-place
  ~ resource "aws_dynamodb_table" "sbeacon_dataportal_users_info" {
        id                          = "sbeacon-dataportal-users-info"
        name                        = "sbeacon-dataportal-users-info"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.vcfs will be updated in-place
  ~ resource "aws_dynamodb_table" "vcfs" {
        id                          = "sbeacon-vcfs"
        name                        = "sbeacon-vcfs"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_glue_catalog_database.metadata-database will be updated in-place
  ~ resource "aws_glue_catalog_database" "metadata-database" {
        id           = "727260606489:sbeacon_metadata"
        name         = "sbeacon_metadata"
      ~ tags         = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all     = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_glue_crawler.sbeacon-crawler will be updated in-place
  ~ resource "aws_glue_crawler" "sbeacon-crawler" {
        id                     = "sbeacon-crawler"
        name                   = "sbeacon-crawler"
      ~ tags                   = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all               = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_iam_instance_profile.ec2_deidentification_instance_profile will be updated in-place
  ~ resource "aws_iam_instance_profile" "ec2_deidentification_instance_profile" {
        id          = "sbeacon_backend_ec2_deidentification_instance_profile"
        name        = "sbeacon_backend_ec2_deidentification_instance_profile"
      ~ tags        = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_policy.extra-glue-policy will be updated in-place
  ~ resource "aws_iam_policy" "extra-glue-policy" {
        id               = "arn:aws:iam::727260606489:policy/extra-glue-policy"
        name             = "extra-glue-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:ListAllMyBuckets",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:GetBucketAcl",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003/*",
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role.ec2_deidentification_instance_role will be updated in-place
  ~ resource "aws_iam_role" "ec2_deidentification_instance_role" {
        id                    = "sbeacon_backend_ec2_deidentification_instance_role"
        name                  = "sbeacon_backend_ec2_deidentification_instance_role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_iam_role.glue_role will be updated in-place
  ~ resource "aws_iam_role" "glue_role" {
        id                    = "glue_role"
        name                  = "glue_role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role.sagemaker_jupyter_instance_role will be updated in-place
  ~ resource "aws_iam_role" "sagemaker_jupyter_instance_role" {
        id                    = "sbeacon_backend_sagemaker_jupyter_instance_role"
        name                  = "sbeacon_backend_sagemaker_jupyter_instance_role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role_policy.ec2_deidentification_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_deidentification_policy" {
        id          = "sbeacon_backend_ec2_deidentification_instance_role:sbeacon_backend_ec2_deidentification_policy"
        name        = "sbeacon_backend_ec2_deidentification_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/staging/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-vcfs",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-projects",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_binaries_layer:7" -> (known after apply)
      ~ code_sha256                 = "YK50yhIZREQkP2PwE5OWcVJg87zBaDqQpwsdhKs1ikE=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-06T03:20:27.884+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_binaries_layer:7" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "xPVB77fIgv8Snlzieu3tDiAkikMmCmR4KZISzNAQdd2YMOoYkQV8pugIWNsM0k9wr1/VntSbddZX2KRehbZzAg==" -> "Y17sGyJkEYuh7BTmS4yGDEn5Gg0aL65w7O/scXX9TW76+OKKcNtWG9aAUOQsVuS3U7sunUt3ImpDZ6g7p4b6ow==" # forces replacement
      ~ source_code_size            = 18422340 -> (known after apply)
      ~ version                     = "7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket.dataportal-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "dataportal-bucket" {
        id                          = "gaspi-dataportal20250521064203402700000004"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.lambda-layers-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "lambda-layers-bucket" {
        id                          = "gaspi-lambda-layers20250521064144424700000001"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.metadata-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "metadata-bucket" {
        id                          = "gaspi-metadata20250521064201492000000003"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "variants-bucket" {
        id                          = "gaspi-variants20250521064153909900000002"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal20250521064203402700000004"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be updated in-place
  ~ resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
        id        = "clone-gaspi-notebooks"
        name      = "clone-gaspi-notebooks"
      ~ tags      = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all  = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.sbeacon.aws_sns_topic.performQuery will be updated in-place
  ~ resource "aws_sns_topic" "performQuery" {
        id                                       = "arn:aws:sns:ap-southeast-3:727260606489:performQuery"
        name                                     = "performQuery"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.sbeacon.aws_sns_topic.splitQuery will be updated in-place
  ~ resource "aws_sns_topic" "splitQuery" {
        id                                       = "arn:aws:sns:ap-southeast-3:727260606489:splitQuery"
        name                                     = "splitQuery"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.security.aws_cloudwatch_event_rule.gaspi-inspector-findings[0] will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "gaspi-inspector-findings" {
        id                  = "gaspi-inspector-findings"
        name                = "gaspi-inspector-findings"
      ~ tags                = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all            = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.security.aws_wafv2_web_acl.security-all-cloudfront will be updated in-place
  ~ resource "aws_wafv2_web_acl" "security-all-cloudfront" {
        id                          = "77faa6dc-82ec-4637-a6b4-43e8a2fa666e"
        name                        = "security-all-cloudfront"
      ~ tags                        = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "s3_access_from_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::webgui-bucket-20250521064143904900000001/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::727260606489:distribution/E1JX27UC7IBGFE",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.webgui.aws_cloudfront_distribution.bui-s3-distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "bui-s3-distribution" {
        id                              = "E1JX27UC7IBGFE"
      ~ tags                            = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                        = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.webgui.aws_s3_bucket.bui-hosted-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "bui-hosted-bucket" {
        id                          = "webgui-bucket-20250521064143904900000001"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront will be updated in-place
  ~ resource "aws_s3_bucket_policy" "s3_access_from_cloudfront" {
        id     = "webgui-bucket-20250521064143904900000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::727260606489:distribution/E1JX27UC7IBGFE"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::webgui-bucket-20250521064143904900000001/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v1.0.0-1-g1cd5017" -> "v1.0.0-62-gf95ebbe+"
        id                            = "version.txt"
      ~ tags                          = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                      = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
      + version_id                    = (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url will be updated in-place
  ~ resource "aws_ssm_parameter" "bui-ssm-beacon-ui-url" {
        id              = "bui-ssm-beacon-ui-url"
        name            = "bui-ssm-beacon-ui-url"
      ~ tags            = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
      ~ tags_all        = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "4795244830223915151" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "a599a1f3df1fc4875410c2f4b787369895be956b" -> "c2e3325e6c060015eada7b96bce9dcb9de850631"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "4572659280296091435" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "a599a1f3df1fc4875410c2f4b787369895be956b" -> "c2e3325e6c060015eada7b96bce9dcb9de850631"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "c0a4ad22-c826-7542-033d-17783f9d68b5" -> (known after apply)
      ~ triggers_replace = [
          ~ "v1.0.0-1-g1cd5017" -> "v1.0.0-62-gf95ebbe+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-customMessageLambdaTrigger"
        name              = "/aws/lambda/cognito-customMessageLambdaTrigger"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-customMessageLambdaTrigger"
        name                  = "cognito-customMessageLambdaTrigger"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-customMessageLambdaTrigger"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6606703815483244583" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747809668748536200" -> "1754533273235029000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-logEmailDelivery"
        name              = "/aws/lambda/cognito-logEmailDelivery"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-logEmailDelivery"
        name                  = "cognito-logEmailDelivery"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-logEmailDelivery"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6151902287922902773" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747809668215581000" -> "1754533274260250000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-sendClinicJobEmail"
        name              = "/aws/lambda/cognito-sendClinicJobEmail"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-sendClinicJobEmail"
        name                  = "cognito-sendClinicJobEmail"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendClinicJobEmail"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3350553090910750060" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754448673941624000" -> "1754533274543173000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-sendRegistrationEmail"
        name              = "/aws/lambda/cognito-sendRegistrationEmail"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-sendRegistrationEmail"
        name                  = "cognito-sendRegistrationEmail"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendRegistrationEmail"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6321780964428505976" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747809668436274000" -> "1754533273849015000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/error-catcher-notifyOnError"
        name              = "/aws/lambda/error-catcher-notifyOnError"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "error-catcher"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "error-catcher-notifyOnError"
        name                  = "error-catcher-notifyOnError"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "error-catcher"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "error-catcher-notifyOnError:error-catcher-notifyOnError"
        name        = "error-catcher-notifyOnError"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "cloudwatch:DescribeAlarms"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudwatch:ap-southeast-3:727260606489:alarm:error-catcher-notifyOnError"
                    },
                  - {
                      - Action   = [
                          - "events:enableRule",
                          - "events:disableRule",
                          - "events:describeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ap-southeast-3:727260606489:rule/error-catcher-notifyOnError-trigger"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::error-catcher-recent-errors-20250707234226378900000001"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::error-catcher-recent-errors-20250707234226378900000001/*"
                    },
                  - {
                      - Action   = [
                          - "cloudwatch:ListMetrics",
                          - "cloudwatch:GetMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:FilterLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ap-southeast-3:727260606489:log-group:/aws/lambda/*"
                    },
                  - {
                      - Action   = "ses:SendEmail"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ses:ap-southeast-3:727260606489:identity/*",
                          - "arn:aws:ses:ap-southeast-3:727260606489:configuration-set/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "error-catcher-notifyOnError"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "error-catcher"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "66202841132625825" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754448673680031000" -> "1754533274185942000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:6cc4a32f7356d29468e86b30a87d4abe1a2d53b067e0bd2e4105916a0737ef64727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:6cc4a32f7356d29468e86b30a87d4abe1a2d53b067e0bd2e4105916a0737ef64" -> (known after apply)
        name         = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers"
      ~ repo_digest  = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers@sha256:d2a82a16ce7d032e513658862769509b8bb7c37a3c5c52bfd206085ad95fa863" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "5354ada9f91edca8ea25e7d36d20298cbc81bbe5" -> "894353dcb22df0382cec0bd2079ffb45ea4c6280"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:42193f65d0fb9950412e210530b92d1ce04bd3bcab5214db819c99d1de723c39" -> (known after apply)
        name                 = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:42193f65d0fb9950412e210530b92d1ce04bd3bcab5214db819c99d1de723c39" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "5354ada9f91edca8ea25e7d36d20298cbc81bbe5" -> "894353dcb22df0382cec0bd2079ffb45ea4c6280"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-batchStarter"
        name              = "/aws/lambda/pgxflow-backend-batchStarter"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-batchStarter"
        name                  = "pgxflow-backend-batchStarter"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-batchStarter:pgxflow-backend-batchStarter-0"
        name        = "pgxflow-backend-batchStarter-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:ap-southeast-3:727260606489:pgxflow-backend-batchSubmitQueue"
                    },
                  - {
                      - Action   = "sns:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:727260606489:pgxflow-backend-initFlow"
                    },
                  - {
                      - Action   = "lambda:GetAccountSettings"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "cloudwatch:GetMetricStatistics"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "HUB_NAME"                       = "RSJPD"
                # (3 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3469604762984379235" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754448673739599000" -> "1754533275174525000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-batchSubmit"
        name              = "/aws/lambda/pgxflow-backend-batchSubmit"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-batchSubmit"
        name                  = "pgxflow-backend-batchSubmit"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-batchSubmit:pgxflow-backend-batchSubmit-0"
        name        = "pgxflow-backend-batchSubmit-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessageBatch",
                          - "sqs:SendMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:ap-southeast-3:727260606489:pgxflow-backend-batchSubmitQueue"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "HUB_NAME"                             = "RSJPD"
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8201731976752354566" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754448674125654000" -> "1754533275450794000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-getResultsURL"
        name              = "/aws/lambda/pgxflow-backend-getResultsURL"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-getResultsURL"
        name                  = "pgxflow-backend-getResultsURL"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8718870845541037433" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754448674141270000" -> "1754533275727133000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-initFlow"
        name              = "/aws/lambda/pgxflow-backend-initFlow"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-initFlow"
        name                  = "pgxflow-backend-initFlow"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-initFlow:pgxflow-backend-initFlow-0"
        name        = "pgxflow-backend-initFlow-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = "projects/*/project-files/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001/*",
                          - "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/project-files/*",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/pgxflow-references",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = "sns:Publish"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sns:ap-southeast-3:727260606489:pgxflow-backend-preprocessor",
                          - "arn:aws:sns:ap-southeast-3:727260606489:pgxflow-backend-dbsnp",
                        ]
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-sendJobEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_lambda_function.this[0] will be updated in-place
  ~ resou
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.